// import { useState, useEffect, useMemo} from "react";
// import axios from "axios";
import styles from "./Assembly-calculator.module.css";

const number_of_cells = 6;

export const Calculator = () => {
  return (
    <>
      <span className={styles.nav}>
        <a href="#">
          <svg
            width="40"
            height="40"
            viewBox="0 0 40 40"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M13.3393 13.3333V19.6058H19.6118V13.3333H13.3393ZM19.068 19.0621H13.883V13.8771H19.0681L19.068 19.0621Z"
              fill="white"
              stroke="white"
              stroke-width="0.554672"
            />
            <path
              d="M13.3393 20.3943V26.6668H19.6118V20.3943H13.3393ZM19.068 26.123H13.883V20.9381H19.0681L19.068 26.123Z"
              fill="white"
              stroke="white"
              stroke-width="0.554672"
            />
            <path
              d="M26.6608 13.3333H20.4125V13.8771H26.6608V13.3333Z"
              fill="white"
              stroke="white"
              stroke-width="0.554672"
            />
            <path
              d="M26.6608 26.1225H20.4125V26.6663H26.6608V26.1225Z"
              fill="white"
              stroke="white"
              stroke-width="0.554672"
            />
            <path
              d="M26.6608 22.9256H20.4125V23.4694H26.6608V22.9256Z"
              fill="white"
              stroke="white"
              stroke-width="0.554672"
            />
            <path
              d="M26.6608 19.7282H20.4125V20.2719H26.6608V19.7282Z"
              fill="white"
              stroke="white"
              stroke-width="0.554672"
            />
            <path
              d="M26.6608 16.5308H20.4125V17.0745H26.6608V16.5308Z"
              fill="white"
              stroke="white"
              stroke-width="0.554672"
            />
          </svg>
          Сборки
        </a>
        <a href="#">
          <svg
            width="40"
            height="40"
            viewBox="0 0 40 40"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M14.709 15.3704C14.3437 15.3704 14.0476 15.6665 14.0476 16.0318C14.0476 16.397 14.3437 16.6931 14.709 16.6931H25.291C25.6563 16.6931 25.9524 16.397 25.9524 16.0318C25.9524 15.6665 25.6563 15.3704 25.291 15.3704H14.709ZM14.0476 20C14.0476 19.6347 14.3437 19.3386 14.709 19.3386H25.291C25.6563 19.3386 25.9524 19.6347 25.9524 20C25.9524 20.3653 25.6563 20.6614 25.291 20.6614H14.709C14.3437 20.6614 14.0476 20.3653 14.0476 20ZM14.0476 23.9683C14.0476 23.603 14.3437 23.3069 14.709 23.3069H25.291C25.6563 23.3069 25.9524 23.603 25.9524 23.9683C25.9524 24.3335 25.6563 24.6296 25.291 24.6296H14.709C14.3437 24.6296 14.0476 24.3335 14.0476 23.9683Z"
              fill="white"
              stroke="white"
              stroke-width="0.000253968"
            />
          </svg>
          Действия
        </a>
        <a href="#">
          <svg
            width="40"
            height="40"
            viewBox="0 0 40 40"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M22.6731 10.8356C22.3706 10.5446 21.8918 10.5446 21.5893 10.8356C21.4859 10.9352 19.2456 13.1028 17.3843 15.7108C16.8061 15.0674 16.3427 14.6155 16.2048 14.4815C15.9023 14.1904 15.4236 14.1904 15.121 14.4815C14.6576 14.9257 10.6173 18.8971 10.6173 21.7195C10.6173 24.7181 12.8807 27.1576 15.661 27.1576C16.0938 27.1576 16.515 27.1002 16.9171 26.9853C18.2767 28.5095 20.1685 29.3788 22.1293 29.3788C26.1313 29.3827 29.3827 25.8594 29.3827 21.5319C29.3827 17.3422 22.9488 11.0999 22.6731 10.8356ZM12.1798 21.7195C12.1798 20.2719 14.133 17.7482 15.661 16.155C17.1852 17.7482 19.1422 20.2681 19.1422 21.7195C19.1422 23.8565 17.5797 25.5951 15.661 25.5951C13.7423 25.5951 12.1798 23.8565 12.1798 21.7195ZM22.1293 27.8202C20.7391 27.8202 19.437 27.2763 18.403 26.2845C19.7855 25.3117 20.7008 23.6305 20.7008 21.7233C20.7008 20.2221 19.5596 18.3992 18.4222 16.9516C19.7204 15.0751 21.3136 13.3517 22.1293 12.5092C24.1092 14.5351 27.8125 18.8779 27.8125 21.5357C27.8202 24.9977 25.2658 27.8202 22.1293 27.8202Z"
              fill="white"
              stroke="white"
              stroke-width="0.000313725"
            />
            <path
              d="M26.6215 21.3327C26.61 20.9076 26.2615 20.5744 25.8402 20.5744C25.8364 20.5744 25.8287 20.5744 25.8249 20.5744C25.396 20.5821 25.0513 20.9383 25.059 21.371C25.059 21.3863 25.0666 22.9488 23.868 24.2471C23.5731 24.5649 23.5999 25.0513 23.9101 25.3539C24.316 25.7445 24.8598 25.4764 25.0168 25.3117C26.6598 23.5271 26.6253 21.4208 26.6215 21.3327Z"
              fill="white"
              stroke="white"
              stroke-width="0.000313725"
            />
          </svg>
          Дебаффы
        </a>
        <a href="#">
          <svg
            width="40"
            height="40"
            viewBox="0 0 40 40"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M12.631 14.9334C12.4228 13.702 13.579 12.6723 14.8009 13.0007L15.7261 13.2494C16.4604 13.4468 17.2395 13.1499 17.6481 12.517L18.5349 11.1436C19.2173 10.0866 20.7827 10.0866 21.4651 11.1436L22.3518 12.517C22.7604 13.1499 23.5396 13.4468 24.2739 13.2494L25.199 13.0007C26.4211 12.6723 27.5772 13.702 27.3689 14.9334L27.1408 16.283C27.0235 16.9766 27.3485 17.6703 27.9603 18.0321L28.806 18.5323C29.9302 19.1971 29.9302 20.8029 28.806 21.4677L27.9603 21.9679C27.3485 22.3296 27.0235 23.0234 27.1408 23.717L27.3689 25.0666C27.5772 26.298 26.4211 27.3277 25.199 26.9993L24.2739 26.7506C23.5396 26.5532 22.7604 26.8501 22.3518 27.483L21.4651 28.8564C20.7827 29.9133 19.2173 29.9133 18.5349 28.8564L17.6481 27.483C17.2395 26.8501 16.4604 26.5532 15.7261 26.7506L14.8009 26.9993C13.579 27.3277 12.4228 26.298 12.631 25.0666L12.8592 23.717C12.9765 23.0234 12.6515 22.3296 12.0397 21.9679L11.194 21.4677C10.0698 20.8029 10.0698 19.1971 11.194 18.5323L12.0397 18.0321C12.6515 17.6703 12.9765 16.9766 12.8592 16.283L12.631 14.9334ZM17.3951 14.8651H14.7902V17.4325L12.1853 20L14.7902 22.5675V25.1349H17.3951L20 27.7024L22.6049 25.1349H25.2098V22.5675L27.8146 20L25.2098 17.4325V14.8651H22.6049L20 12.2976L17.3951 14.8651Z"
              fill="white"
              stroke="white"
              stroke-width="0.000336842"
            />
            <path
              d="M23.9048 20C23.9048 22.1269 22.1554 23.8511 19.9975 23.8511C17.8395 23.8511 16.0901 22.1269 16.0901 20C16.0901 17.8731 17.8395 16.1488 19.9975 16.1488C22.1554 16.1488 23.9048 17.8731 23.9048 20ZM17.8242 20C17.8242 21.183 18.7972 22.142 19.9975 22.142C21.1977 22.142 22.1707 21.183 22.1707 20C22.1707 18.817 21.1977 17.858 19.9975 17.858C18.7972 17.858 17.8242 18.817 17.8242 20Z"
              fill="white"
              stroke="white"
              stroke-width="0.000336842"
            />
          </svg>
          Настройки
        </a>
      </span>
      <article className={styles.main}>
        <div className={styles.column_1}>
          <article className={styles.cells}>
            <h2>Контейнер</h2>

            {Array.from({ length: number_of_cells }).map((_, index) => (
              <i key={index}>
                <p>Ячейка</p>
              </i>
            ))}
          </article>
          <article className={styles.container}>
            <img src="/src/assets/g35n 1.png" alt="container" />
            <h3>Контейнер «Берлога-6»</h3>
            <ul>
              <li>6</li>
              <li>
                <img src="/src/svg/SVGRepo_iconCarrier.svg" alt="Щит" />
                78.5%
              </li>
              <li>
                <img src="/src/svg/SVGRepo_iconCarrier (1).svg" alt="Молния" />
                100%
              </li>
            </ul>
            <span className={styles.buttomns}>
              <a className={styles.rerol} href="#">
                <img
                  src="/src/svg/search-and-replace-svgrepo-com (1) 1.svg"
                  alt="Заменить"
                />
                Заменить
              </a>
              <a className={styles.clean} href="#">
                <img
                  src="/src/svg/trash-blank-alt-svgrepo-com 1.svg"
                  alt="Удалить"
                />
                Удалить
              </a>
            </span>
          </article>
          <article className={styles.armor}>
            <img src="/src/assets/empty-armor 1.png" alt="" />
            <h3>Броня не выброна</h3>
            <span className={styles.bottomn}>
              <a className={styles.choose} href="#">
                Выбрать броню
              </a>
              {/* <a href="#"></a> */}
            </span>
          </article>
        </div>
        <div className={styles.column_2}>
          <article className={styles.features}>
            <h2>Свойства артефакта</h2>
            {/* Пока сдесь нет логики отрисовки */}
            <p>Сначала выберите артефакт в разделе «Контейнер»</p>
          </article>
          <article className={styles.amplifications}></article>
        </div>
        <div className={styles.column_3}>
          <article className={styles.final_characteristics}>
            {/* Пока сдесь нет логики отрисовки */}
            <div className={styles.title}>
              <p>Приведённое здоровье</p>
              <p>Лечение в секунду</p>
            </div>
            <div className={styles.number}>
              <p>100.00</p>
              <p>0.5%</p>
            </div>
          </article>
        </div>
      </article>
    </>
  );
};
